---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructure.LayerCount
source: html/8598a249-81da-128f-8629-0bcb2c8f3c3c.htm
---
# Autodesk.Revit.DB.CompoundStructure.LayerCount Property

Returns the number of layers contained in this CompoundStructure.

## Syntax (C#)
```csharp
public int LayerCount { get; }
```

## Remarks
Establishes the valid range of indices passed to various access functions: [0 ... this value - 1]